rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'bg-warning hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'bg-warning hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "To Be Decided"], ["rating", "PG"], ["release_date", "2000-01-01 00:00:00.000000"], ["created_at", "2020-03-05 22:32:40.611533"], ["updated_at", "2020-03-05 22:32:40.611533"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Ridley Scott"], ["updated_at", "2020-03-05 23:13:57.893584"], ["id", 6]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 4]]
---
  def find_director
      @movie = Movie.find(params[:id])